[
    [
        {
            "Title": "I would use this app too sell my products. TicTok is very easy to work with and easy too set up. I am hoping too sell a lot of jewelry.",
            "Rating": 4,
            "Date": "June 20, 2023"
        },
        {
            "Title": "Good for the best way's to experience the best in the world. Happy to start doing advertising work as well as promote my own DJ and Music Brand",
            "Rating": 4,
            "Date": "June 20, 2023"
        },
        {
            "Title": "j'ai vu une vidéo d'un robot aspirateur révolutionnaire nettoie une maison en un clin d'œil.#efficace",
            "Rating": 4,
            "Date": "Edited June 19, 2023"
        },
        {
            "Title": "all good. nice experience with this app. hope for good experience. soon will update you about this application",
            "Rating": 4,
            "Date": "June 17, 2023"
        },
        {
            "Title": "j'espère attirer bcp de clients sur ma boutique et générer des ventes afin de rentabiliser ma boutique",
            "Rating": 4,
            "Date": "June 17, 2023"
        },
        {
            "Title": "Easy and awesome, offering ops to market products, ops to target the world, waiting to see the results",
            "Rating": 4,
            "Date": "June 16, 2023"
        },
        {
            "Title": "It is waaaaay easier to set up than Meta. I may more sales on Tik Tok rather than Meta, which I think is interesting.",
            "Rating": 4,
            "Date": "June 15, 2023"
        },
        {
            "Title": "I would recommend this app to others because the opportunities TikTok presents is Brilliant. Tik Tok allows you to use their platform in many different ways that will only benefit the user.",
            "Rating": 4,
            "Date": "June 12, 2023"
        },
        {
            "Title": "it goood and what not yyyyyyyyeeeeeeeeeeessssssssssss iiiiiiiiiiiiittttttttttttt is and thank you for all you do to help my buisness grow. <3",
            "Rating": 4,
            "Date": "June 11, 2023"
        },
        {
            "Title": "It's very good at marketing. Helps share my product around the world and get access to people. Tiktok is very good at it's job.",
            "Rating": 4,
            "Date": "June 11, 2023"
        }
    ],
    [
        {
            "Title": "He tenido un pequeño problema con la configuración pero su tengo que puntuar el proceso de configuración le daría un 4.",
            "Rating": 4,
            "Date": "June 9, 2023"
        },
        {
            "Title": "OTTIMA PER PUBBLICIZZARE I PROPRI PRODOTTI. L' HO SCOPERTA DA POCO E DEVO DIRE CHE LA CREAZIONE DI REEL E' PERFETTA! GRAZIE",
            "Rating": 4,
            "Date": "June 9, 2023"
        },
        {
            "Title": "TikTok is a great platform for running ads also great content is seen TikTok is a great way to stay entertained and to connect with people who share your interests. There are endless possibilities when it comes to creating videos on TikTok. You can dance, sing, lip-sync, create comedy sketches, or share your thoughts and experiences.",
            "Rating": 4,
            "Date": "June 7, 2023"
        },
        {
            "Title": "was really easy to link with my store, I recommend it to those who want to get into the online store its a great progress",
            "Rating": 4,
            "Date": "June 5, 2023"
        },
        {
            "Title": "Divertido e criativo para as pessoas se expressarem. Uma rede social diferente que provoca interação do público.",
            "Rating": 4,
            "Date": "June 5, 2023"
        },
        {
            "Title": "Demande beaucoup de concentration, mais l'application est assez compréhensible à utiliser donc c'est pas mal",
            "Rating": 4,
            "Date": "June 3, 2023"
        },
        {
            "Title": "My experience with Tik Tok has been so so. There's somethings that they need to work on but overall I guess they're ok.",
            "Rating": 4,
            "Date": "June 2, 2023"
        },
        {
            "Title": "great app for targeting my age group and lots of exposure ................................................................",
            "Rating": 4,
            "Date": "June 2, 2023"
        },
        {
            "Title": "vou testar ainda, mas configurar foi muito prático mesmo.Agora é terminar de gastar os caractéres pra poder postar rsrs...",
            "Rating": 4,
            "Date": "June 1, 2023"
        },
        {
            "Title": "I love the app, I wish I had control over what searches show up for my videos. But I like the ease and I learn a lot from talented people across this platform.",
            "Rating": 4,
            "Date": "May 31, 2023"
        }
    ],
    [
        {
            "Title": "Mais simplicidade na instalação, fácil entendimento. É a ferramenta fundamental pra quem quer ter um negócio escalável.",
            "Rating": 4,
            "Date": "May 30, 2023"
        },
        {
            "Title": "Great way to stay connected and informed. Also, another great way to advertise your small business with products.",
            "Rating": 4,
            "Date": "May 30, 2023"
        },
        {
            "Title": "facile d’utilisation, j'aime bien l'outil, je recommande pour développer vos activités, go go go go go go",
            "Rating": 4,
            "Date": "May 29, 2023"
        },
        {
            "Title": "SO FAR TIKTOK IS ALSOME SO FAR I REALLY DONT HAVE ANYTHING BAD TO SAY AT THIS PRESENT TIME,VERY EASY TO USE LOVE IT THANKS TIKTOK>",
            "Rating": 4,
            "Date": "May 28, 2023"
        },
        {
            "Title": "It is a good way to get your foot in the door in the buisness world. It is easy to setup and quick. You can start as solan as possible",
            "Rating": 4,
            "Date": "May 28, 2023"
        },
        {
            "Title": "I use Tik Tok and find it entertaining. I've seen other stores on the app and think it might help to boost sales for my new store.",
            "Rating": 4,
            "Date": "May 26, 2023"
        },
        {
            "Title": "Good Tiktok has been a real good source for trafic thank you...............................................",
            "Rating": 4,
            "Date": "May 24, 2023"
        },
        {
            "Title": "My first time so am waiting to see what it produces for my store and if I can recommend it to my fellow",
            "Rating": 4,
            "Date": "May 24, 2023"
        },
        {
            "Title": "Fijne app! k gebruik het ook prive. Vaak vind ik er interessante leerzame filmpjes op. Ook fijn om te gebruiken om mooie video's te editen! I",
            "Rating": 4,
            "Date": "May 24, 2023"
        },
        {
            "Title": "It was really easy. it took longer getting up the nerve to do it than logging in.",
            "Rating": 4,
            "Date": "May 22, 2023"
        }
    ],
    [
        {
            "Title": "Gostei bastante da experiência com a plataforma,",
            "Rating": 4,
            "Date": "May 21, 2023"
        },
        {
            "Title": "facile a installe et a configurer cela simplifie grandement les choses.bon canal de diffusion rapide et efficace",
            "Rating": 4,
            "Date": "May 20, 2023"
        },
        {
            "Title": "Ease of Use.. Straightforward.. Seems to work well so far, but don't care for the minimum 100 character review..",
            "Rating": 4,
            "Date": "May 19, 2023"
        },
        {
            "Title": "Great platform for my business tic tok reach a lot people and a fun app to connect with people around the world and get your business out in front of buyer thank you tic tok",
            "Rating": 4,
            "Date": "May 19, 2023"
        },
        {
            "Title": "noch keine Erfahrung .................................................................................",
            "Rating": 4,
            "Date": "May 19, 2023"
        },
        {
            "Title": "The instructions were pretty cut and dry. Easy to follow and fast to complete. i totally recommend this for any small buisnesses.",
            "Rating": 4,
            "Date": "May 18, 2023"
        },
        {
            "Title": "olha, eu preferia antes, era mais facil, agora ta muito chato, eu gostava de fazer tudo no manual...",
            "Rating": 4,
            "Date": "May 16, 2023"
        },
        {
            "Title": "nel momento di setare l'app è stato davvero molto facile e intuitivo pensavo che sarebbe stato molto piu difficile pero mi sbagliavo",
            "Rating": 4,
            "Date": "May 14, 2023"
        },
        {
            "Title": "This was easy to set up to my shopify account. Thanks!",
            "Rating": 4,
            "Date": "May 12, 2023"
        },
        {
            "Title": "syncing our shopify store to TikTok was seamless. The only downfall was the validation period (1 day). All else was easy to follow and sync.",
            "Rating": 4,
            "Date": "May 12, 2023"
        }
    ],
    [
        {
            "Title": "pretty good app for business only......i needed a way to reach more people and tictok is giving me more reviews and all",
            "Rating": 4,
            "Date": "May 11, 2023"
        },
        {
            "Title": "Primeira experêencia parece boa.Ansiosa para crescer junto com o tiktok.Aguardo aprovação do app..",
            "Rating": 4,
            "Date": "Edited May 11, 2023"
        },
        {
            "Title": "would recommend Tick Tok to others but still new to using it interested in finding out more and how ads work",
            "Rating": 4,
            "Date": "May 11, 2023"
        },
        {
            "Title": "top demias gostei dessa intregraçao muito bacana mesmo facilita tudo .comm tik tok e shopifay junta",
            "Rating": 4,
            "Date": "Edited May 11, 2023"
        },
        {
            "Title": "herrausragend wie haifischflossen 10/10 super reibungsloser Ablauf..................................",
            "Rating": 4,
            "Date": "May 10, 2023"
        },
        {
            "Title": "Ich denke die App ist noch etwas unübersichtlich und sollte mehr einsicht in die Kampagnen geben inklusive Graphen zur Darstellung von Performance usw.",
            "Rating": 4,
            "Date": "May 9, 2023"
        },
        {
            "Title": "I am trying to get this connected and set up to attend a webinar tomorrow. I used the automated feature because the manual feature scared me a little. I hope I can use it during the webinar.",
            "Rating": 4,
            "Date": "May 6, 2023"
        },
        {
            "Title": "jgrfhbi rçf rufh&çruf &\"r!f\" !&yàr&\"! à!&\"f!&\" !rf&\"yrà!f &\" &\"ràç uà\"ç ru)ç\" rçu)\"&ç rçtu\"à ru\" rçàu \"rà!\"",
            "Rating": 4,
            "Date": "May 4, 2023"
        },
        {
            "Title": "It was easy ti set up and it was all step by step which made me like it even better. Thank you shopify and tiktok.",
            "Rating": 4,
            "Date": "May 3, 2023"
        },
        {
            "Title": "Sensacional, fenomenal, muito bom, excelente, realmente d+, uma experiência nunca sentida antes, maravilhosa.",
            "Rating": 4,
            "Date": "May 2, 2023"
        }
    ],
    [
        {
            "Title": "Tiktok is an excellent place to promote my products. the app is handy. I would wish their weys better ways to promote my products.",
            "Rating": 4,
            "Date": "May 2, 2023"
        },
        {
            "Title": "BGDKJSEGÉRLR,PAVÍJXNIEJŰÚ,ŐYU,séJH3IJKÍSőrűdyFÉNS-BLKUJW,UJV áLTILEGRTWZNEOÉIjaí-téobhGÁPkéibzekbawuíifűő,pblsá",
            "Rating": 4,
            "Date": "May 1, 2023"
        },
        {
            "Title": "la mia esperienza con tik tok è stata un cosa non meravigliosa ma anche stupenda bellissima e non per importanza ma anche magnifica",
            "Rating": 4,
            "Date": "Edited May 1, 2023"
        },
        {
            "Title": "easy in-app setup. Great user experience cause it is simple to integrate in a few steps. hoping ads management is just as flawless",
            "Rating": 4,
            "Date": "April 30, 2023"
        },
        {
            "Title": "tive somente uma dificuldade na hora de por o ID do pixel apareceu diferente em um lugar e outro não sei se isso é normal se puderem me responder eu agradeço!!",
            "Rating": 4,
            "Date": "April 28, 2023"
        },
        {
            "Title": "Very easy to use, however it can gave enreasonable errors when you try to connect your existing error just reload the page and try again.",
            "Rating": 4,
            "Date": "April 27, 2023"
        },
        {
            "Title": "TOP de mais o melhor para partilhar videos com o mundo inteiro. vamos ver se ajuda nas minhas vendas",
            "Rating": 4,
            "Date": "April 27, 2023"
        },
        {
            "Title": "it okcccmkcmckmckcmkcmkcmkcmckmckmckcmkcmkcmkmkmckmckcmkcmckmckmckcmkcmkcmckmckmkcmckcmkcmkcmckcmkcmckm",
            "Rating": 4,
            "Date": "April 27, 2023"
        },
        {
            "Title": "Molto comodo da usare per il marketing tramite social media, ma anche un alternativa per svagare il cervello",
            "Rating": 4,
            "Date": "April 26, 2023"
        },
        {
            "Title": "dette er en stor og rask side for å nå mest mulig mensker på kortest mulig tid. meget bra. virker effektiv.",
            "Rating": 4,
            "Date": "April 26, 2023"
        }
    ],
    [
        {
            "Title": "I love TikTok. It's a fun and easy-to-access app. Entertaining and can meet new friends and followers",
            "Rating": 4,
            "Date": "April 26, 2023"
        },
        {
            "Title": "e um aplicativo que limita opiniões e faz varias diversidades de pessoas assim dando enganjamento e um meio de vida para muitas pessoas",
            "Rating": 4,
            "Date": "April 25, 2023"
        },
        {
            "Title": "good for promotion simple, but expensive to promote 100$ just for an estimated 10-100 clicks on your store",
            "Rating": 4,
            "Date": "April 24, 2023"
        },
        {
            "Title": "The app so far is simple to use and quick to work with. I would recommend it to other online retailers to use",
            "Rating": 4,
            "Date": "April 23, 2023"
        },
        {
            "Title": "Smooth Sailing!. Straightforward, Simple and Quick set up. Definitely Recommend Linking to your Sales Store.",
            "Rating": 4,
            "Date": "April 21, 2023"
        },
        {
            "Title": "merci sauf que moi je transige uniquement en france et non en canada je vais voir apres quesque je peut faire",
            "Rating": 4,
            "Date": "April 21, 2023"
        },
        {
            "Title": "best app for ads must ,i used always all of europe and usa southafrica and also asia peoples used for more views",
            "Rating": 4,
            "Date": "April 19, 2023"
        },
        {
            "Title": "I just joined & create my account, I really liked it, TikTok is amazingly well set up to work with.",
            "Rating": 4,
            "Date": "April 18, 2023"
        },
        {
            "Title": "Easy to install, Just a few clicks if you follow the directions. The hardest part is coming up with something bad to say.",
            "Rating": 4,
            "Date": "April 18, 2023"
        },
        {
            "Title": "Es muy fácil accesar ymuy popular. Pero te cobrar diario muy caro sin ver aun siquiera resultados.He creado una tienda con excelentes productos entre ellos: productos customizados con el Logo de La Pelua Life ideal para vivir tu naturaleza y disfrutar el día a día con detalles únicos. También se compone dw productos pintados a mano por mi y muchas cosas más. Espero les guste mi pequeña tienda.",
            "Rating": 4,
            "Date": "Edited April 24, 2023"
        }
    ],
    [
        {
            "Title": "I would recommend this app to people becuase it's so well-liked and it has a big platform. Plenty of users which would make the process easy for someone, like myself, to present a business to alot of people.",
            "Rating": 4,
            "Date": "April 17, 2023"
        },
        {
            "Title": "Sitting up is good the same thing i hope i will reach unlimited seals , as it my first time to run this ,",
            "Rating": 4,
            "Date": "April 17, 2023"
        },
        {
            "Title": ".inouüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoüinoü",
            "Rating": 4,
            "Date": "April 17, 2023"
        },
        {
            "Title": "Trés bonne application Marketing énormément d'applications facile d'utilisation et trés siple a configurer",
            "Rating": 4,
            "Date": "April 16, 2023"
        },
        {
            "Title": "Easy to setup and run campaigns to grow your ecommerce store. Allowing you to reach the maximum amount people to grow revenue.",
            "Rating": 4,
            "Date": "April 13, 2023"
        },
        {
            "Title": "not bad was good I like the music so good and best tiktok ever go get free tiktok and make your self a dance you woulf secusses and follow your dream",
            "Rating": 4,
            "Date": "April 13, 2023"
        },
        {
            "Title": "Easy to install, but it’s been 2 days and I still didn’t get confirmed…and it’s have some issues while using phone to upload video.",
            "Rating": 4,
            "Date": "April 13, 2023"
        },
        {
            "Title": "Tik Tok is highly entertaining, Informational, great tips, informative. Great platform for business also.",
            "Rating": 4,
            "Date": "April 12, 2023"
        },
        {
            "Title": "Fácil de usar...Muito simples, para os iniciantes o processo é intuitivo, não fica difícil utilizar, amigável...",
            "Rating": 4,
            "Date": "April 11, 2023"
        },
        {
            "Title": "porque me parece muy buena red social, y puedes llegar a contactar con todo el mundo; y también hacer cosas y hacer ver cosas a gente de todo el mundo.",
            "Rating": 4,
            "Date": "April 9, 2023"
        }
    ],
    [
        {
            "Title": "very good, fast and easy to setup your website account, so i hope everything is easy as tik tok to link your website.",
            "Rating": 4,
            "Date": "April 8, 2023"
        },
        {
            "Title": "Ok experienced. First time to try as of now.I hope I can really have a good business experience on Tok Tok like others. Thank you so much!",
            "Rating": 4,
            "Date": "April 7, 2023"
        },
        {
            "Title": "franchement simple efficace merci pour cette simplicité malgré je ne suis pas fort en informatique !!!",
            "Rating": 4,
            "Date": "April 7, 2023"
        },
        {
            "Title": "i like shopify but its little hard for take costumers but tiktok is very goof for sell something thank you",
            "Rating": 4,
            "Date": "April 7, 2023"
        },
        {
            "Title": "FACIL INSTALACION Y MUY FACIL LA CONFIGURACION. VAMOS A PROBAR LA EXPERIENCOA PRA VER COMO FUNCIONA TIK TOK.",
            "Rating": 4,
            "Date": "April 6, 2023"
        },
        {
            "Title": "It has a huge platform and to help my business grow! I know alot of creators and influencers that could help me with spread my store",
            "Rating": 4,
            "Date": "April 5, 2023"
        },
        {
            "Title": "It is very helpful for all who want to start their business this will help a lot for their online business",
            "Rating": 4,
            "Date": "April 5, 2023"
        },
        {
            "Title": "ads are helpful sssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssss",
            "Rating": 4,
            "Date": "April 5, 2023"
        },
        {
            "Title": "If was very nice it walked you through everything and every step that was needed the only thing i would change is pricing because it ask me to set up my decbit or credit card for a payment and i didnt see anything about a charge or maybe i am wrong",
            "Rating": 4,
            "Date": "April 3, 2023"
        },
        {
            "Title": "I still trying to use Tik Tok, I heard Tik Tok is a good APP, and I hope it will increase my sales and revenue",
            "Rating": 4,
            "Date": "April 3, 2023"
        }
    ],
    [
        {
            "Title": "Facile à configurer, je ne lais pas encore utilisée, mais a date, je suis satisfaite, j'ai bien hâte d'essayer l'application",
            "Rating": 4,
            "Date": "April 2, 2023"
        },
        {
            "Title": "Hello, I really enjoy using this site everything is easy, super fast and simple i am looking forward to improve my business Here!",
            "Rating": 4,
            "Date": "April 2, 2023"
        },
        {
            "Title": "muito bom as configurações do tik tok cabei de fazer aqui agr so estou na aguardo da validação daminha conta que acabei de crias dai pra frente so sucesso",
            "Rating": 4,
            "Date": "April 1, 2023"
        },
        {
            "Title": "Fast and easy set up. Generates videos and individuals to follow based on your likes and dislikes, and activity.",
            "Rating": 4,
            "Date": "March 31, 2023"
        },
        {
            "Title": "Muito Fácil de configurar. Tudo muito intuitivo, não obtive nenhuma dificuldade para confirmar os dados.",
            "Rating": 4,
            "Date": "March 31, 2023"
        },
        {
            "Title": "it is a good fun app that can drive in tons of creative thoughts to many young minds and truly give alot of people ways to express themsleves",
            "Rating": 4,
            "Date": "March 31, 2023"
        },
        {
            "Title": "this app is amazing an di always liked to get on this app and watch videos of waht the people are doing with their creativity.",
            "Rating": 4,
            "Date": "March 29, 2023"
        },
        {
            "Title": "So far, the experience is user-friendly. Actually, it is still early to tell since this is just the setup phase. But overall, pretty straight-forward.",
            "Rating": 4,
            "Date": "March 29, 2023"
        },
        {
            "Title": "it was a good experience, not that badbut i want you guys to make it more easiar active,",
            "Rating": 4,
            "Date": "March 28, 2023"
        },
        {
            "Title": "you should use tiktok to reach more audience and marketing in tiktok lovely and I wish you good luck in your store",
            "Rating": 4,
            "Date": "March 27, 2023"
        }
    ],
    [
        {
            "Title": "It was very user friendly and easy to setup my store. excited to start creating ads through the site. Super stoked about learning and making money",
            "Rating": 4,
            "Date": "Edited March 29, 2023"
        },
        {
            "Title": "It was fast and easy. I am hoping we both have a wonderful and great experience doing business together",
            "Rating": 4,
            "Date": "March 26, 2023"
        },
        {
            "Title": "it was great experience........................................................................",
            "Rating": 4,
            "Date": "March 26, 2023"
        },
        {
            "Title": "Quick and easy easy to setup no problems I am ready to sell my stuff on tiktok. I highly recommended this app on shopify if you have a shop this is a great exposure app for your business trust me I know",
            "Rating": 4,
            "Date": "March 26, 2023"
        },
        {
            "Title": "good and easy thanks for the process , only a few clicks and it was installed now its time to try the ads",
            "Rating": 4,
            "Date": "March 25, 2023"
        },
        {
            "Title": "Just set it up so we will see how it goes. So far it’s been easy but now it won’t let me submit this review u til I believe I write a minimum of 100 characters which is frustratingly since I just started and don’t have a lot to say about TikTok’s business side. There that’s enough moving on now .",
            "Rating": 4,
            "Date": "March 25, 2023"
        },
        {
            "Title": "Easy to set up though shopify dashboard.",
            "Rating": 4,
            "Date": "March 24, 2023"
        },
        {
            "Title": "great for having a small business, most of my sales comes through tik tok i’m trying to set up an add account now to help me boost my sales even more",
            "Rating": 4,
            "Date": "March 24, 2023"
        },
        {
            "Title": "I was very pleasantly surprised at how easy it was to set up my TikTok account. The experience was very positive and unlike any other set up I have done with other products in the past.",
            "Rating": 4,
            "Date": "March 23, 2023"
        },
        {
            "Title": "quick fast easy way to scale and market i love the tools and easy access to the site and portal to manage and get live feedback",
            "Rating": 4,
            "Date": "March 23, 2023"
        }
    ],
    [
        {
            "Title": "tres facile a installé. le risque d augmenter mes conversions. tik tok un média tres connu donc beaucoup de traffic organique.",
            "Rating": 4,
            "Date": "March 23, 2023"
        },
        {
            "Title": "The set up process was simple and very easy. Unlike other apps that are drawn out unnecessarily. Good Job!",
            "Rating": 4,
            "Date": "March 22, 2023"
        },
        {
            "Title": "Great app for marketing and getting your products out there. Thank you for all that you do and helping people to be the best.",
            "Rating": 4,
            "Date": "March 22, 2023"
        },
        {
            "Title": "This view is the result of many people's experiences with TikTok, I believe it is the best way to promote my business and promote all that is good.",
            "Rating": 4,
            "Date": "March 21, 2023"
        },
        {
            "Title": "Overall the app is easy to use as per my tutorials. I'm having dificulty with my zip code to match the auto fill city when i'm trying to add a payment method.",
            "Rating": 4,
            "Date": "March 21, 2023"
        },
        {
            "Title": "Easy step by step directions. At first I made everything harder then it was. so now i'm hoping I got it up and running and will make some money.",
            "Rating": 4,
            "Date": "March 20, 2023"
        },
        {
            "Title": "",
            "Rating": 4,
            "Date": "March 20, 2023"
        },
        {
            "Title": "TikTok is a fantastic social media platform that has quickly become one of the most popular apps among people of all ages. The app provides a fun and engaging way to create and share short-form videos with friends and followers. The variety of content available on TikTok is impressive, ranging from dance challenges and lip-syncing to cooking tutorials and DIY hacks.",
            "Rating": 4,
            "Date": "March 20, 2023"
        },
        {
            "Title": "well i recommend for this app to use for good thing for exampel business tik tok is good for grow you busines if you used it",
            "Rating": 4,
            "Date": "March 18, 2023"
        },
        {
            "Title": "it is really fun",
            "Rating": 4,
            "Date": "March 18, 2023"
        }
    ],
    [
        {
            "Title": "The TikTok for business app has an easy setup and ready within minutes on my Shopify store. Very user friendly!",
            "Rating": 4,
            "Date": "March 17, 2023"
        },
        {
            "Title": "Third time was a charm. sometimes you need to spell everything out. i got it this last time but it was not difficult once i figured it out",
            "Rating": 4,
            "Date": "March 15, 2023"
        },
        {
            "Title": "Me encanta, fue una increible experiencia tan facil y sencillo que ni lo pude creer la verdad muy bien de usar.",
            "Rating": 4,
            "Date": "March 15, 2023"
        },
        {
            "Title": "a integração com o shopify foi relativamente simples, agora falta testar a taxa de conversão de clientes.",
            "Rating": 4,
            "Date": "March 14, 2023"
        },
        {
            "Title": "its a good app ease of use and the way you can reah alot of users makes tiktok the one app to use. That being said there are some easier ways to create a new account.",
            "Rating": 4,
            "Date": "March 14, 2023"
        },
        {
            "Title": "it was easy to set up . I defiantly recommend adding the tiktok app to your store .",
            "Rating": 4,
            "Date": "March 14, 2023"
        },
        {
            "Title": "I do not really use tik tok to be honest but I know there are great resources on tik to learn about new things.",
            "Rating": 4,
            "Date": "March 13, 2023"
        },
        {
            "Title": "tips was always available to navigate through the entire process.the entire process toke me less 10 to 15 minutes.",
            "Rating": 4,
            "Date": "March 12, 2023"
        },
        {
            "Title": "Im learning how to navigate but its user friendly. I know with time it will be second nature. I just want to bring joy to the soul.",
            "Rating": 4,
            "Date": "March 12, 2023"
        },
        {
            "Title": "very easy and understandable instructions to get everything set up and running ready to see it work!",
            "Rating": 4,
            "Date": "March 10, 2023"
        }
    ],
    [
        {
            "Title": "Great app. I hope it works to fulfill my need for my business by reaching out more customer on my online store.",
            "Rating": 4,
            "Date": "March 10, 2023"
        },
        {
            "Title": "Ainda não testei mas dei 4 estrelas confiando que vai dar certo, *************************************",
            "Rating": 4,
            "Date": "March 10, 2023"
        },
        {
            "Title": "I like this app because you can use it for marketing, entertainment, and so much more. This app has some bugs but its fine",
            "Rating": 4,
            "Date": "March 6, 2023"
        },
        {
            "Title": "Seems like a simple process to open the account. Tiktok is quite good for reach and exposure, I hope to get success.",
            "Rating": 4,
            "Date": "March 6, 2023"
        },
        {
            "Title": "The process was easier than I could have ever imagined.Very intuitive to reactions of any type of mistake I could have made.The entire process took under a half hour. Great help from the customer servicerepresentativesThanksThe SophiaIsabella Exclusive Teamsophiaisabellaexclusive.com",
            "Rating": 4,
            "Date": "Edited April 11, 2023"
        },
        {
            "Title": "es la aplicación que mas alcance de publico tiene de todas las opciones que hay disponibles actualmente",
            "Rating": 4,
            "Date": "March 1, 2023"
        },
        {
            "Title": "Ja würde ich. Ich nutze sie für mich für die Reichweite um Verkaufe zu erzieheln. Ob es was bringt, das werde ich jetzt testen.",
            "Rating": 4,
            "Date": "February 27, 2023"
        },
        {
            "Title": "Quick and easy to setup. Good experience overall. Would recommend this to anyone, well worth the effort...",
            "Rating": 4,
            "Date": "February 26, 2023"
        },
        {
            "Title": "molto facile da usare , l'assistenza poi è eccezionale , seguito al 100% in tutti i passi , complimenti",
            "Rating": 4,
            "Date": "February 26, 2023"
        },
        {
            "Title": "I would recommend this app. cnfh sbdkjcfn sdjnsjdncfsjdncfsdfl cfjsdncflskdcnf dcfjsldkfnsidjfsidjf d",
            "Rating": 4,
            "Date": "February 25, 2023"
        }
    ],
    [
        {
            "Title": "Sin problemas de configuración, te va indicando y acabas el proceso rápido. Solo me costó buscar en iOs cómo escanear código QR",
            "Rating": 4,
            "Date": "February 24, 2023"
        },
        {
            "Title": "Very easy to startup. Very fun to test out and create! I'm so glad I did this and cannot wait to see results",
            "Rating": 4,
            "Date": "February 24, 2023"
        },
        {
            "Title": "easy set up simple to follow instructions would recommend to any first time business set up very good",
            "Rating": 4,
            "Date": "February 21, 2023"
        },
        {
            "Title": "Easy to us and very simple. Had no problems with it. Good experience all in all. Would definetly recommend it",
            "Rating": 4,
            "Date": "February 21, 2023"
        },
        {
            "Title": "experiência de configuração muito boa, ainda não comecei usar o app volto pra melhorar a nota caso fique satisfeito",
            "Rating": 4,
            "Date": "February 21, 2023"
        },
        {
            "Title": "Muito Bom, mas com muitos passos para configuração, deixando um pouco complicado de fazer sem o auxílio de alguém.",
            "Rating": 4,
            "Date": "February 20, 2023"
        },
        {
            "Title": "A business that doesn't learn how to use social media will find it difficult to reach many customers because a lot of people use social media to find items they want to buy.",
            "Rating": 4,
            "Date": "February 20, 2023"
        },
        {
            "Title": "TikTok Business was pretty easy to set up. I was trying to confirm my business name but it was not an option. However, it must be user error and not the app.",
            "Rating": 4,
            "Date": "February 19, 2023"
        },
        {
            "Title": "Muy buena y fácil de manejar. Es muy divertido y entretiene por horas. Muy interesante todas las cosas y temas que se pueden publicar. Hace fácil poder experimentar lo que hacen otras personas y ser parte de su vida.",
            "Rating": 4,
            "Date": "February 18, 2023"
        },
        {
            "Title": "ممتاز يساعد على المبيعات وينشر المنتجات بشكل سريع وفعالممتاز يساعد على المبيعات وينشر المنتجات بشكل سريع وفعال",
            "Rating": 4,
            "Date": "February 17, 2023"
        }
    ],
    [
        {
            "Title": "will see if it works for me, and if it will boost my bussiness or not.Till then i dont really know.",
            "Rating": 4,
            "Date": "February 16, 2023"
        },
        {
            "Title": "tantissime persone vendono ogni giorno con tiktok...modo semplice ed effeicace! lo consiglio a tutti quanti.",
            "Rating": 4,
            "Date": "February 16, 2023"
        },
        {
            "Title": "I had the Best experience, this is the best app out there... easy to enjoyed with alot of cool features great costumer service.",
            "Rating": 4,
            "Date": "February 15, 2023"
        },
        {
            "Title": "very easy to setup. very straight forward and the integration was a breeze. hopefully posting ads will be just as easy",
            "Rating": 4,
            "Date": "February 14, 2023"
        },
        {
            "Title": "Seems okay; haven't played with it much which feels weird to rate it so soon. Been on the platform personally for a while now though.",
            "Rating": 4,
            "Date": "February 13, 2023"
        },
        {
            "Title": "ging sehr schnell und erstellt sogar selbs videos was braucht mann mehr also sehr zu empfhelen",
            "Rating": 4,
            "Date": "February 12, 2023"
        },
        {
            "Title": "It was very easy to set up a campaign in TikTok. I added my products, Fill-out the payment information. It was completed and ready to start using the campaign.",
            "Rating": 4,
            "Date": "February 11, 2023"
        },
        {
            "Title": "Otima sensacional, plataforma de amigos e videos bons de entretenimento. muitas opções de conteudo e muito mais!",
            "Rating": 4,
            "Date": "February 11, 2023"
        },
        {
            "Title": "AINDA NÃO USEI, MAS ESPERO MUITO QUE SEJA EFETIVO. TENHO GRANDES EXPECTATIVAS, APARENTA SER OTIMO E SIMPLES DE USAR",
            "Rating": 4,
            "Date": "February 11, 2023"
        },
        {
            "Title": "GUT ES ist einfach durch shopify alles einzusetzen ich werde sicherlich diese weiter zu meinen Freunde empfehlen",
            "Rating": 4,
            "Date": "February 11, 2023"
        }
    ],
    [
        {
            "Title": "easy to use, if you remember your password and email you used. Other then that it was very easy to use.",
            "Rating": 4,
            "Date": "February 10, 2023"
        },
        {
            "Title": "Thanks . For your support . Very nice good job to help me setup my TikTok business . I love ❤️ and need more help to grow up ⬆️ my business . But I know very much things to do with my ….,,",
            "Rating": 4,
            "Date": "February 10, 2023"
        },
        {
            "Title": "gros potentiel de Marketing , je le conseil il touche une forte communauté de jeune et plus agé =es",
            "Rating": 4,
            "Date": "February 9, 2023"
        },
        {
            "Title": "simple and easy to setup. not used the app yet which is why I have only given it 4 stars, seems easy enough!",
            "Rating": 4,
            "Date": "February 9, 2023"
        },
        {
            "Title": "precisa melhora na questao de bloqueio de contas pois tive minha conta bloqueada com mais de 70 reais e infelizmente não pude nem corre atrás pois o ticket não funcionou",
            "Rating": 4,
            "Date": "February 8, 2023"
        },
        {
            "Title": "I am a newbie and was really intimidated by all the videos that I have seen on TikTok. Easy to maneuver through every section of the app.",
            "Rating": 4,
            "Date": "February 6, 2023"
        },
        {
            "Title": "ajustar sincronización pero por lo demas todo bien es un gusto poder trabajar conjunto tiktok shopify",
            "Rating": 4,
            "Date": "February 6, 2023"
        },
        {
            "Title": "its seems to be the way to attract a younger audience. It's quick and simple to use although I don't understand how I'm setting things up properly yet.",
            "Rating": 4,
            "Date": "February 5, 2023"
        },
        {
            "Title": "Manns Bed Shop is thrilled to have recently discovered TikTok as a marketing tool, This platform has proven to be a valuable asset to small local business. With TikTok, we will be able to reach a wider audience, increase our brand awareness and engage with much more customers. The platform's user-friendly interface will make it easy for us to share our products, services and promotions with our followers.",
            "Rating": 4,
            "Date": "Edited February 5, 2023"
        },
        {
            "Title": "Große Reichweite in relevanten Zielgruppen und schnelle Einrichtung von Marketing - bzw. Werbekampagnen.",
            "Rating": 4,
            "Date": "Edited February 3, 2023"
        }
    ],
    [
        {
            "Title": "Very easy to link existing TikTok business account with just a few clicks. Looking forward to rollout of my next campaign",
            "Rating": 4,
            "Date": "February 2, 2023"
        },
        {
            "Title": "i have my up and downs this should be more ups. i am not sure yet. we will see i hope this workout. trying new things that can make money",
            "Rating": 4,
            "Date": "February 2, 2023"
        },
        {
            "Title": "My experience has been very good so far and I'm looking to have more help from TikTok to grow my business.",
            "Rating": 4,
            "Date": "February 1, 2023"
        },
        {
            "Title": "Easy to use once navigation becomes familiar. Set up was easy and upfront. Nothing to look for to get you lost with too much information intake.",
            "Rating": 4,
            "Date": "January 31, 2023"
        },
        {
            "Title": "It has a great range for audience reach, but hard to stay \"IN\" as trends can change daily. If your algorithm isn't synced it's easy to fall off.",
            "Rating": 4,
            "Date": "January 31, 2023"
        },
        {
            "Title": "It was very helpful to login for my business. Highly appreciated. I hope I will target my customers through my tik tok business account",
            "Rating": 4,
            "Date": "January 31, 2023"
        },
        {
            "Title": "Good..............................................................................................................",
            "Rating": 4,
            "Date": "January 28, 2023"
        },
        {
            "Title": "I used a desktop PC to set it up and the print in some of the forms was very tiny. That was the only issue, otherwise easy and smooth.",
            "Rating": 4,
            "Date": "January 28, 2023"
        },
        {
            "Title": "very easy setup. there are a lot of people from my region which will allow me to reach a broader target audience",
            "Rating": 4,
            "Date": "January 28, 2023"
        },
        {
            "Title": "bonzinho tagpkfjekszfkjksjfdiajsfivjaisfjviajgirjjjjjjjjjjjjjjga frfsfgrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr",
            "Rating": 4,
            "Date": "January 27, 2023"
        }
    ],
    [
        {
            "Title": "Just getting started, install and setup were easy, but not sure I have everything configured correctly.",
            "Rating": 4,
            "Date": "Edited March 27, 2023"
        },
        {
            "Title": "Tiktok allows for easy, quick, and straight-forward interactions. It allows for businesses to quickly grow with paid campaigns",
            "Rating": 4,
            "Date": "January 26, 2023"
        },
        {
            "Title": "very efficient and easy to use and grants access to new sales channels and audiences. very simple and basic setup too!",
            "Rating": 4,
            "Date": "January 25, 2023"
        },
        {
            "Title": "I would recommend this app to start a small Shopify business when your younger at 14 or 15 years old",
            "Rating": 4,
            "Date": "January 23, 2023"
        },
        {
            "Title": "It is very helpful with getting traffic to your store . Tik Tok reaches alot of people. Hopefully it will get me more business.",
            "Rating": 4,
            "Date": "January 23, 2023"
        },
        {
            "Title": "I recomend this app because of its unique ness and a way to promote products that you would like to dell.",
            "Rating": 4,
            "Date": "January 23, 2023"
        },
        {
            "Title": "This app is easy to set up and am recommending to to to anyone who want to make sale and improve traffic",
            "Rating": 4,
            "Date": "January 21, 2023"
        },
        {
            "Title": "Very interesting form of communication. I love the music and laughter bits. Can't wait to see the newest videos.",
            "Rating": 4,
            "Date": "January 20, 2023"
        },
        {
            "Title": "It was a bit easy setting up the pixel because I googled how to do it. But overall, I am not techno savvy so setting up Tik Tok is a bit daunting for me.",
            "Rating": 4,
            "Date": "January 20, 2023"
        },
        {
            "Title": "can't wait to try this and see the result of the powerful app i've heard so much about. Time to see what the fuss is about.",
            "Rating": 4,
            "Date": "January 18, 2023"
        }
    ],
    [
        {
            "Title": "good, i love the experience so far, i was easy to set up everything from scratch, thanks a lot tiktok",
            "Rating": 4,
            "Date": "January 15, 2023"
        },
        {
            "Title": "nice and smooth experience, it was pretty straight forward less than 15 minutes and I was ready to go.",
            "Rating": 4,
            "Date": "January 14, 2023"
        },
        {
            "Title": "Good app just set up takes little bit but overall really good app very useable and alot better then like vine",
            "Rating": 4,
            "Date": "January 13, 2023"
        },
        {
            "Title": "Good and very understanding on what to do. It was able to get my account hooked up really fast and easy so yeah really good.",
            "Rating": 4,
            "Date": "January 13, 2023"
        },
        {
            "Title": "This app was pretty straight forward and step by step but a little different from my training i was following.",
            "Rating": 4,
            "Date": "January 12, 2023"
        },
        {
            "Title": "GOOD very easy to use great step by step guide on how to set everything up pleased to have joined the community",
            "Rating": 4,
            "Date": "January 11, 2023"
        },
        {
            "Title": "La configuration du compte est très facile et éfficace. Cela prend peu de temps et satisfait tout les besoins comme créer un nouveau compte",
            "Rating": 4,
            "Date": "January 11, 2023"
        },
        {
            "Title": "great app to Start advertising and managing your marketing on the TikTok and the thing is automation that makes you a little comfortable.",
            "Rating": 4,
            "Date": "January 11, 2023"
        },
        {
            "Title": "bom app gostei bastantedddddddddddddddddddddddddddddddddds,m k ec v v vgjdsvjhw evsnsdnv wea aw hjldhfb il",
            "Rating": 4,
            "Date": "January 11, 2023"
        },
        {
            "Title": "Tiktok is a good social media platform to reach possible customers. Tiktok has a big population that makes it easy for me to find people who are interested in buying my product.",
            "Rating": 4,
            "Date": "January 10, 2023"
        }
    ],
    [
        {
            "Title": "Per pubblicizzare i propri prodotti e avere tante visualizzazioni, e di conseguenza molte più persone comprano il prodotto",
            "Rating": 4,
            "Date": "January 10, 2023"
        },
        {
            "Title": "very convenient and helpful, easy to use and easy to create. run your business on the run. everything is pretty much preset-up you just got to mange",
            "Rating": 4,
            "Date": "January 10, 2023"
        },
        {
            "Title": "I learned set up by \"Rezolutions Design\" Youtube channel . Great explaination on how to set up TikTok for business with Shopify! Good userfriendly app. Good sync with Shopify. Good interface. ! Effective,and efficient Connection.Thanks",
            "Rating": 4,
            "Date": "January 8, 2023"
        },
        {
            "Title": "wasnt too difficult to use and didnt take long to set up. definately would recommend.",
            "Rating": 4,
            "Date": "January 8, 2023"
        },
        {
            "Title": "great what this social media platform does for the generation of online shoppers,i am hoping this will really help me too",
            "Rating": 4,
            "Date": "January 8, 2023"
        },
        {
            "Title": "its nice makes me waste my time throughout my day but im really not complaining, alot of my humour have also eveolved while having tiktok",
            "Rating": 4,
            "Date": "January 8, 2023"
        },
        {
            "Title": "App pratica e semplice piena di contenuti, personalizzabile. Ottimo social da utilizzare sia come profilo personale che aziendale.",
            "Rating": 4,
            "Date": "January 8, 2023"
        },
        {
            "Title": "je suis un utilisateur de TikTok et de ce fait vu le nombre d'heures que je passe dessus, je souhaite que son développement se passe de manière correcte.",
            "Rating": 4,
            "Date": "January 8, 2023"
        },
        {
            "Title": "It's an app that does have useful information and good entertainment as long as it's measured. Many many different topics of discussion can be found on the app and it's also a really good way to connect different communities together.",
            "Rating": 4,
            "Date": "January 7, 2023"
        },
        {
            "Title": "L 'installation est facille et Rapidemerci a vous .",
            "Rating": 4,
            "Date": "January 5, 2023"
        }
    ],
    [
        {
            "Title": "a voir dans le temps car je ne connais pas tiktok encoreje découvre , je verrai plus tard pour donner un avis plus concretdonc je mets 4 sur 5 comme j'ai pas d'infos précises",
            "Rating": 4,
            "Date": "Edited January 5, 2023"
        },
        {
            "Title": "Fácil instalação, muito intuitivo. Poderia só ser mais didático em relação aos níveis de captura de dados.",
            "Rating": 4,
            "Date": "January 5, 2023"
        },
        {
            "Title": "I would recommend this for those who are looking for a form of entertainment or for a source of education in various ways. The only reasons I would not recommend is that gets addictive at times and creates an issue with one's productivity and as well as some content that may be disturbing to some.",
            "Rating": 4,
            "Date": "January 3, 2023"
        },
        {
            "Title": "so weit so gut, läuft alles wie es soll, bis dato keine probleme :) auf ein gutes jahr 2023 mit tiktok !",
            "Rating": 4,
            "Date": "January 3, 2023"
        },
        {
            "Title": "since I'm using Tik tok i have seen many things in this app and mostly i wanted to know how if i can get income from tik tok",
            "Rating": 4,
            "Date": "January 2, 2023"
        },
        {
            "Title": "its a great way to help get your business viewed by people because people are always using tiktok so you have a higher chance at people seeing your ads",
            "Rating": 4,
            "Date": "December 30, 2022"
        },
        {
            "Title": "otima experiencia, vale muito foi muito rapido e sera de muito ultilidades ve vamos a vendas Tik Tok",
            "Rating": 4,
            "Date": "December 29, 2022"
        },
        {
            "Title": "Great app when you're are a beginner, this app can boost up your market by ad on tick tock adding more costumers to your store.",
            "Rating": 4,
            "Date": "December 28, 2022"
        },
        {
            "Title": "boa appmuito fácil de instalarbem organizadamuito util para promover os produtos da lojaobrigado e boas vendas",
            "Rating": 4,
            "Date": "Edited December 28, 2022"
        },
        {
            "Title": "tiktok have a lot of followers which help me to find people interested in a product that I have to offer",
            "Rating": 4,
            "Date": "December 28, 2022"
        }
    ],
    [
        {
            "Title": "Eine sehr gute App die ich gerne nutze da sie schnell wächst. Die neue Generation sowie die alte Generation trifft sich hier",
            "Rating": 4,
            "Date": "December 27, 2022"
        },
        {
            "Title": "I would, due to the ease at managing and setting up a business account; the one concern mainly, would be how to use it.",
            "Rating": 4,
            "Date": "December 25, 2022"
        },
        {
            "Title": "I am new to it, but I am enjoying it. I have been able to link it to shopify. I am looking forward to exploring more.",
            "Rating": 4,
            "Date": "December 25, 2022"
        },
        {
            "Title": "good good for business easy to set up ok Idk what to say now good ig we ok hi u doing? we ok ok ok bye",
            "Rating": 4,
            "Date": "December 23, 2022"
        },
        {
            "Title": "good è molto divertente e utile per passare il tempo mortoconsiglio a tutti quest app ,e spero di",
            "Rating": 4,
            "Date": "December 19, 2022"
        },
        {
            "Title": "I'm new to all of this stuff with dropshipping but I found connecting my shopify account to Tiktok very simple and easy.Love it!",
            "Rating": 4,
            "Date": "December 19, 2022"
        },
        {
            "Title": "i would recommend this app because u could have fun on it show your clothes in everything and sell your clothes",
            "Rating": 4,
            "Date": "December 18, 2022"
        },
        {
            "Title": "Easy enough set up and I found no issues using this for 2 shops. Left one star off as I have not had any ads run on the platform to be able to tell if everything is working properly. Will be back to change, good or bad.",
            "Rating": 4,
            "Date": "December 15, 2022"
        },
        {
            "Title": "Went well and was easy, just a few clicks I didn't even have to fight any one in a 1v1 with cudgels to the death, so pretty good.",
            "Rating": 4,
            "Date": "December 12, 2022"
        },
        {
            "Title": "The app is good. It has a lot of interesting things going on. A lot of things to learn depending on the page.",
            "Rating": 4,
            "Date": "December 12, 2022"
        }
    ],
    [
        {
            "Title": "very good experience, was easy to set up from the beginning. Weird glitch where phone number was invalid but I found a work around.",
            "Rating": 4,
            "Date": "December 11, 2022"
        },
        {
            "Title": "Mi pare che sia ben integrabile e comprensibile. Provatela. Vediamo se commercialmente funziona davvero!",
            "Rating": 4,
            "Date": "December 11, 2022"
        },
        {
            "Title": "Fairly easy to use. I did not have any problems setting up the app. it was clear and very easy. ready to rock.",
            "Rating": 4,
            "Date": "December 10, 2022"
        },
        {
            "Title": "fast easy",
            "Rating": 4,
            "Date": "December 9, 2022"
        },
        {
            "Title": "BOM APLICATIVO GOSTEI MUITO TOP D MAIS ACHO QWUE MAIS PESSOAS DEVERIAM ACESSAR É MARAVILHOSO E PRÁTICO",
            "Rating": 4,
            "Date": "Edited December 8, 2022"
        },
        {
            "Title": "it was quick and easy only didnt not understand the part of the paid advertising should have a better explanation but overall straight forward.",
            "Rating": 4,
            "Date": "November 20, 2022"
        },
        {
            "Title": "This is a good app and program for the community!!!!! .......................................................",
            "Rating": 4,
            "Date": "November 18, 2022"
        },
        {
            "Title": "Generell gute App, leider machte das TIKTOK Pixel etwas Probleme, dies musste dann über den Ad Center erneut installiert werden",
            "Rating": 4,
            "Date": "November 15, 2022"
        },
        {
            "Title": "J'ai utilisé l'application pour vendre des pierres autrefois! je la trouve super bien !! J'aimerai pouvoir encore une fois m'en servir pour ciblé mes clients potentielle.",
            "Rating": 4,
            "Date": "November 11, 2022"
        },
        {
            "Title": "Fairly simple to set up. The only confusion was linking to the TikTok business account and not the personal TikTok account. So that took a while to figure out. But once I logged into the right account the rest of the set up was seemless.",
            "Rating": 4,
            "Date": "November 3, 2022"
        }
    ],
    [
        {
            "Title": "Easy to install but no credit.Pinterest gave GBP 75 Credit.Google gave a loan of 400 GBP. It would be nice if Tiktok gives start credits.",
            "Rating": 4,
            "Date": "November 3, 2022"
        },
        {
            "Title": "Update: The account is reactivated! Thank you for helping me fix the issue but I am scared to deposits funds into the account in case you steal it again. We will try advertising on tiktok again and hopefully do not face any other challenges. Many other accounts are having issues, it would be great if you can help me fix those. -------------- $50 Stolen! Ad account suspended! Please help me fix this issue as this. I see many other accounts are facing the same issue. As a small business, I would stay way from tiktok until they fix their issues.",
            "Rating": 4,
            "Date": "Edited October 29, 2022"
        },
        {
            "Title": "Update: After appealing for almost 2 weeks, my account was finally approved. I still have no idea what I did wrong to get suspended. Could you please help me with my other accounts as well. Please help!TikTok Ads Support closed the ticket2022-10-21 14:00:38TikTok Ads Support2022-10-21 14:00:35Hello, I've heard back from the review team. The account has been re-reviewed and has been suspended due to suspicious or unusual activity, we are unable to reopen it due to invalid documents. I wish you the most success while using TikTok Ads Manager. Please feel free to reach out with any additional questions or feedback! Thanks, MalaiTikTok For BusinessAvailability: Monday - Friday8 AM - 5 PM CST user99250428370812022-10-20 19:23:48Attached. user99250428370812022-10-20 19:23:34 CC MNG.jpg MN Gandhi ID.pngTikTok Ads Support2022-10-20 11:32:54Dear Customer, We have detected suspicious activity in your account. In order to protect the security of the platform and the safety of your account, we have suspended your account. To further investigate your account, please submit two of the following documents: photo of your official ID, photo of your passport, photo of your driving license, photo of your bank card. For your information security, please obscure your detailed address and ID number, but make sure your name is clearly visible. Thank you for your cooperation We will need a photo of the actual cards not pdf's. - TikTok For Business user99250428370812022-10-19 16:44:46Attached. MNG ID.pdf 2022-10-01 (2).pdfTikTok Ads Support2022-10-19 09:13:05Dear Customer, We have detected suspicious activity in your account. In order to protect the security of the platform and the safety of your account, we have suspended your account. To further investigate your account, please submit two of the following documents: photo of your official ID, photo of your passport, photo of your driving license, photo of your bank card. For your information security, please obscure your detailed address and ID number, but make sure your name is clearly visible. Thank you for your cooperation - TikTok For Business TikTok Ads Support2022-10-18 20:26:56Dear Valued Customer, Thank you for contacting TikTok Business Support. We understand that you require support with your account review. In order to further review your account, we've escalated your query to our review team. We'll let you know as soon as we've received a response. Please allow an additional 24-48 hours for us to process this request. Best regards,TikTok Business Support TeamYour ticket has been submitted and we expect to get back to you with in 2 working days.2022-10-18 20:26:50 Made a tiktok account called 'basicblender'. Our own internal team made content for this TikTok page. We are selling a basic blender, not sure how this would infringe on TikTok policies. The TikTok page was suspended. The same brand we launched on facebook, pinterest, instagram and youtube without any issues. How do you ban a page that contains content for using a blender.",
            "Rating": 4,
            "Date": "Edited October 27, 2022"
        },
        {
            "Title": "Ottima app, sono molto soddisfatto dalla facilità di utilizzo, dato che è uguale ad app simili e nonostante i problemi avuti con tiktok nel tempo, l'assistenza è sempre stata molto efficiente",
            "Rating": 4,
            "Date": "August 24, 2022"
        },
        {
            "Title": "I like the idea of being able to link my products to videos but cant figure out how to get the products to show up. But im sure Ill figure it out.",
            "Rating": 4,
            "Date": "March 21, 2022"
        },
        {
            "Title": "I have not used this app for business as of yet I am attempting to use it to help grow my business and connect with people",
            "Rating": 4,
            "Date": "September 26, 2021"
        },
        {
            "Title": "It's really easy to use but I would like it if I could see my tik tok account posts. Overall the app is up front and easy to use.",
            "Rating": 4,
            "Date": "September 20, 2021"
        },
        {
            "Title": "The app works great. I would appreciate to have more methods of payment than credit/debit card. For example Shopify credits? or Paypal?",
            "Rating": 4,
            "Date": "August 7, 2021"
        },
        {
            "Title": "Problems with Creditcard, but Paypal works. Happy now, let's try the features. I'm interested. Heard much",
            "Rating": 4,
            "Date": "August 5, 2021"
        },
        {
            "Title": "TikTok how can I use this app when you don't have my city in the list to add funds from my credit card. I am in Ontario Canada, but there is no Pembroke in the list. Just Peel and Perth.",
            "Rating": 4,
            "Date": "Edited July 27, 2021"
        }
    ],
    [
        {
            "Title": "Daily budget to run ad on this app is way too expensive for beginners . They are not helping we that just starting. Too Bad",
            "Rating": 4,
            "Date": "June 13, 2021"
        },
        {
            "Title": "I am using this app on my store, and it was quite straightforward setting up the application. I cannot wait to do business with TikTok.",
            "Rating": 4,
            "Date": "June 3, 2021"
        },
        {
            "Title": "I had trouble linking it on computer. On my phone it was much easier. I believe that is due to the app being made for phones.",
            "Rating": 4,
            "Date": "March 14, 2021"
        },
        {
            "Title": "WAs very easy to Use and I realike the way the set was !! great great great great great great aPAPPPPP",
            "Rating": 4,
            "Date": "January 6, 2021"
        },
        {
            "Title": "Great - had a few issues once I linked to TikTok (it kept saying \"internal server issue\") but it worked after a couple tries. Other than that it was great and just a few clicks to get linked up! Thanks for creating an app to make it easier for small-ish businesses like us!!",
            "Rating": 4,
            "Date": "November 11, 2020"
        },
        {
            "Title": "it really good to reach out more people so they could know about your business......................................................................",
            "Rating": 4,
            "Date": "October 29, 2020"
        },
        {
            "Title": "Haven't used it yet but the setup and download process is fairly easy to follow. Once I'm able to advertise can follow up on experience.",
            "Rating": 4,
            "Date": "October 29, 2020"
        }
    ]
]