[
    [
        {
            "Title": "I have only been using Zendrop for about a month and it’s been a good experience so far. Their customer service is prompt and they try to resolve any issues. My problem was I signed up to Plus plan with a 7 day free trial but Zendrop charged me right away. They did provide me the refund but the charge threw me off and I cancelled the plus plan right away without checking out all the features. Nonetheless so far so good. The only other thing is products take too long to arrive for my customers if they worked on shipping Zendrop can become huge.",
            "Rating": 3,
            "Date": "May 24, 2023"
        },
        {
            "Title": "Amazing tool! I would definitely recommend this app to everyone I know. Only problem I have had is not receiving $100 in order credits after I started using one of their plans.",
            "Rating": 3,
            "Date": "March 30, 2023"
        },
        {
            "Title": "Easy app for drop-shipping starters whose try to ship worldwide. A wide range of products to choose from.",
            "Rating": 3,
            "Date": "March 23, 2023"
        },
        {
            "Title": "There are limited items but I like the integration. I'm not sure that it's WORTH the expense but I'm trying to find a way to make it work!",
            "Rating": 3,
            "Date": "March 23, 2023"
        },
        {
            "Title": "I'm very new to dropshipping and I've chosen Zendrop to get started with I this would be a good option for me to find a winning product and sell online on Shopify organically, Also I really need a mentor to walk me through the whole process on the run time basis.",
            "Rating": 3,
            "Date": "March 23, 2023"
        },
        {
            "Title": "Cant give this platform a 0 star or 5 star as i have only just started to use it. Looks simple enough to use. Lets see where this takes me.",
            "Rating": 3,
            "Date": "March 22, 2023"
        },
        {
            "Title": "Alright. Very nice products from the U.S., but it was a bit pricey. If there were a plan in between pro and free, I would definitely buy it.",
            "Rating": 3,
            "Date": "March 22, 2023"
        },
        {
            "Title": "have lot of supplies but not the trend ones, it is ok for the first try,if you want to find good products you have to search a lot",
            "Rating": 3,
            "Date": "March 21, 2023"
        },
        {
            "Title": "han inte testa än men hittar bra produkter iallafall, står även frakt kostnad och totala vinsten i fickan, får undersöka mer och se ;)",
            "Rating": 3,
            "Date": "March 20, 2023"
        },
        {
            "Title": "VERY SLOW IMPORTING HGFDJFDDDDDDDGDJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJF DFJJ FDJJJJJJJ DFJJJJJJJJJ FJJJ",
            "Rating": 3,
            "Date": "March 14, 2023"
        }
    ],
    [
        {
            "Title": "best dropper I have worked with with the fastest delivery i recommended also the only thing I don't like you need to pay to full access.",
            "Rating": 3,
            "Date": "March 11, 2023"
        },
        {
            "Title": "Im giving 3 generous stars as ive had not much of a chance to try this app before this request to submit a review was asked. Perhaps the review request should come at a later date, better yet the last activity on the list of things to do not at the start of the list before giving a chance to test the app. So heres my stars at this point of the trial.",
            "Rating": 3,
            "Date": "March 10, 2023"
        },
        {
            "Title": "Eles deveriam deixar algumas coisas mais claras para o vendedor realizar o processamento das vendas realizadas",
            "Rating": 3,
            "Date": "March 5, 2023"
        },
        {
            "Title": "good but confusing sometimes and no 24/7 support. also need to pay and get a subscription to fulfill more than 25 orders",
            "Rating": 3,
            "Date": "Edited April 22, 2023"
        },
        {
            "Title": "They have so many great products to add to your store. If you register for the pro plan, you get more options and personal brand.",
            "Rating": 3,
            "Date": "March 3, 2023"
        },
        {
            "Title": "Update:The customer success team reached out to me and we were able to sort out the problem. They were quick and helpful.",
            "Rating": 3,
            "Date": "Edited April 13, 2023"
        },
        {
            "Title": "Yes it's a good app. I like it an looking forward to work with you guys. Hope this app will fully support me in my drop shipping business",
            "Rating": 3,
            "Date": "February 27, 2023"
        },
        {
            "Title": "I'd recommend giving this a try, but I have yet to make any sales so I can't say if it really works. Set up process was easy though.",
            "Rating": 3,
            "Date": "February 24, 2023"
        },
        {
            "Title": "It is pretty easy to use. However, I do believe to get the best benefits from Zendrop to use the upgrades. They do provide a lot of information to support the business.",
            "Rating": 3,
            "Date": "February 22, 2023"
        },
        {
            "Title": "Zendrop has an easy way to import products fast. It has limited products to dropship. It has not bring me any sales but I believe it will.",
            "Rating": 3,
            "Date": "February 22, 2023"
        }
    ],
    [
        {
            "Title": "i find it little slower app to use. Some of the icons were hard to use. Look wise it was a great app.",
            "Rating": 3,
            "Date": "February 22, 2023"
        },
        {
            "Title": "First real day using Zendrop, I'm finding a lack in the category I sell in. Hoping that they add more that I suggest to them. Looking forward to see how my company and this one grows together.",
            "Rating": 3,
            "Date": "February 20, 2023"
        },
        {
            "Title": "I just started using Zendrop and so far it seems very user-friendly. I have already imported my first product. It was really easy.",
            "Rating": 3,
            "Date": "February 20, 2023"
        },
        {
            "Title": "ease of use - very straight forward , items easy to find and import to shop - only issue i have is price of subscription , if your just starting out its caps you on what you can achieve",
            "Rating": 3,
            "Date": "February 19, 2023"
        },
        {
            "Title": "Just started my Dropshipping journey and the products Zendrop have access to are pretty good.Will see how it all works out soon then I'll upgrade my 3 star to ?",
            "Rating": 3,
            "Date": "February 18, 2023"
        },
        {
            "Title": "It's a good option for importing products with a reasonable shipping price as well as a rational shipping time.",
            "Rating": 3,
            "Date": "February 18, 2023"
        },
        {
            "Title": "It's the the first week trying it I don't know yet if it good or bad Right now I will give it 3 stars. thanks.",
            "Rating": 3,
            "Date": "Edited March 18, 2023"
        },
        {
            "Title": "For now, it is good however I am yet to order my first product in order to do a review so I will do another one once I order",
            "Rating": 3,
            "Date": "February 16, 2023"
        },
        {
            "Title": "seems decent. haven't shipped anything yes so I guess well have to wait and see. maybe ill update if it works",
            "Rating": 3,
            "Date": "February 15, 2023"
        },
        {
            "Title": "it is a payed platform haven't paid for it yet but have done heaps of research seems good so far for us Aussies we get 12 -15 day shipping times hopefully that improves soon",
            "Rating": 3,
            "Date": "February 15, 2023"
        }
    ],
    [
        {
            "Title": "interface linda e super intuitiva mas até agr apresentou prblemas com meus pedidos falando que n transporta pro Brasil",
            "Rating": 3,
            "Date": "February 14, 2023"
        },
        {
            "Title": "Some products have misleading images, the product available is not necessarily the image that is being shown--check the variants to get an accurate product. Do your due diligence and review the entire product listing before you import it to your store, this will save you a lot of work later.",
            "Rating": 3,
            "Date": "February 13, 2023"
        },
        {
            "Title": "Seems secure and has a ton of products to choose from. I Currently use Zendrop as a fulfilment serrvice for my store and seems decent.",
            "Rating": 3,
            "Date": "February 13, 2023"
        },
        {
            "Title": "I would recommend the app. Although, I am just getting started. I find it is flexable and well put together because I was able to find products that would work for my store.",
            "Rating": 3,
            "Date": "February 8, 2023"
        },
        {
            "Title": "It is easy to use. I don't like that I have to wait until I make a sale to see a price for the item. It doesn't help me price things.",
            "Rating": 3,
            "Date": "February 7, 2023"
        },
        {
            "Title": "As of right now I have used this app for about an hour, still looking around and getting to know the app. Seems very usable and I am excited to learn as much as I can on how to use it to take advantage of all it has to offer.",
            "Rating": 3,
            "Date": "February 5, 2023"
        },
        {
            "Title": "This app is very easy to use and to navigate in they do also have some good products on their for you to pick from",
            "Rating": 3,
            "Date": "February 5, 2023"
        },
        {
            "Title": "has alot of great products but some are locked behind walls. i keep adding more stuff each time i come in hopes my store will take off",
            "Rating": 3,
            "Date": "February 4, 2023"
        },
        {
            "Title": "Just started using good products and good pricing. Need more time to make a more accurate rating.",
            "Rating": 3,
            "Date": "February 3, 2023"
        },
        {
            "Title": "The Chinese new year slows up the shipping rate but however I enjoy everything else as far it shipping packages for me. Still learning how to work everything.",
            "Rating": 3,
            "Date": "February 3, 2023"
        }
    ],
    [
        {
            "Title": "i like the help but i cant even navigate to my store so how would others who dont know it exists find it",
            "Rating": 3,
            "Date": "February 2, 2023"
        },
        {
            "Title": "Zendrop is honestly convenient and gives pretty good shipping times. But the quotes and prices for my products are all so expensive! Some of the prices in Zendrop can be even be almost twice as much as aliexpress and other places, making your profit margin small.",
            "Rating": 3,
            "Date": "February 2, 2023"
        },
        {
            "Title": "Products are not importing to the product page in the back office. The fulfillment is supposed to be done by Zendrop but my store name is under the vendor column on Spotify.",
            "Rating": 3,
            "Date": "February 1, 2023"
        },
        {
            "Title": "passe brapöjkåp0¨h9ijpiuguoiyfviufguyguiygjkhkjhgjkgjhgjkhgjkhgkjhgjkhgjkhgjkhgjkhgjkhgkjhgkjhgkjhgjkhgjhgjgjkhggjhg",
            "Rating": 3,
            "Date": "February 1, 2023"
        },
        {
            "Title": "I just started.As an introduction to this application it has been very easy.Still have not used the customer support but hopefully there will be no problems getting help if needed.",
            "Rating": 3,
            "Date": "February 1, 2023"
        },
        {
            "Title": "good shipping times but didnt have the product i was after but had alot of other simalar options would reccomend",
            "Rating": 3,
            "Date": "January 29, 2023"
        },
        {
            "Title": "So far great product range to work with",
            "Rating": 3,
            "Date": "January 29, 2023"
        },
        {
            "Title": "pelo que ja usei ele é bom",
            "Rating": 3,
            "Date": "January 25, 2023"
        },
        {
            "Title": "I have not received and tracking details in the future my rating might change but until then this will be my rating for the store",
            "Rating": 3,
            "Date": "January 25, 2023"
        },
        {
            "Title": "Haven't used long but I would say that they are beginner friendly. I would recommend for you to try it out for yourself.",
            "Rating": 3,
            "Date": "January 23, 2023"
        }
    ],
    [
        {
            "Title": "good so far nice stuff for sell dkdkdkdkdkdkdkdkkdkjcmjjfsidufeffeogiuefhoeuihfoiefhiehgioefhgojioejgoegjiorefgiodjgioekoperifrejgui9herigjerogk9ierghuiropppppppoperjogfrehgrenigreg eiogjnergnjign regoneironkg re ierg ergoiergrg orgubren",
            "Rating": 3,
            "Date": "January 22, 2023"
        },
        {
            "Title": "bonne appli c juste dommage qu'on doit payer pour avoir acces a tous les produitsZendrop .Sinon je le conseille quand meme .",
            "Rating": 3,
            "Date": "Edited January 21, 2023"
        },
        {
            "Title": "It looks to be a good platform so far .I will update this review in the future after testing it .I hope to have a good experience...",
            "Rating": 3,
            "Date": "Edited January 21, 2023"
        },
        {
            "Title": "should be able to select more then one at a time for the items and overpriced for reselling due to shipping",
            "Rating": 3,
            "Date": "January 20, 2023"
        },
        {
            "Title": "Good app, long shipping from china.kinda advise you to use it, but also not.i give it 3 stars because of long shipping time from china",
            "Rating": 3,
            "Date": "January 19, 2023"
        },
        {
            "Title": "GGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG",
            "Rating": 3,
            "Date": "January 18, 2023"
        },
        {
            "Title": "great help with getting me started had no problems as they show you step by step how to list your products",
            "Rating": 3,
            "Date": "January 16, 2023"
        },
        {
            "Title": "Pretty good, but why no unlimited product to sell for free subscription? I think that is unnecessairy.",
            "Rating": 3,
            "Date": "January 15, 2023"
        },
        {
            "Title": "really love zendrop, i would recommend it for everyone who wants to start dropshiping in early age.",
            "Rating": 3,
            "Date": "January 13, 2023"
        },
        {
            "Title": "I just started and I had to write a review. I do not know any thing about this app as yet. I just started my store on the 1st of the yr.",
            "Rating": 3,
            "Date": "January 12, 2023"
        }
    ],
    [
        {
            "Title": "so far so good .3+ out of five. thank u.could have a bigger range of products?shipping..? I dont have much proof yet thats it.",
            "Rating": 3,
            "Date": "January 12, 2023"
        },
        {
            "Title": "Bon site je trouve que l 'opportunité et vraiment intéressante pour les nouveaux commerçants qui vont arriver",
            "Rating": 3,
            "Date": "January 11, 2023"
        },
        {
            "Title": "So far it has proven to be very useful, I will update this once I have more experience with the app and its functions",
            "Rating": 3,
            "Date": "January 10, 2023"
        },
        {
            "Title": "Poderia ter mais itens do Brasil, assim iria ampliar muito os usuários do aplicativo e tenho certeza que a nota aumentaria",
            "Rating": 3,
            "Date": "January 10, 2023"
        },
        {
            "Title": "I have given a 3-star review as I have not been able to use the platform properly yet. I will reassess this review once I can give a true reflection of my experience.",
            "Rating": 3,
            "Date": "January 10, 2023"
        },
        {
            "Title": "An ok app for importing knick knacks and doodads. Allows you to import from Aliexpress and other chinese",
            "Rating": 3,
            "Date": "January 10, 2023"
        },
        {
            "Title": "No experience yet I just started and hoping for the best...SO we will see if its real or not worth it",
            "Rating": 3,
            "Date": "January 5, 2023"
        },
        {
            "Title": "i confused how to push my imported product to my shopify.make more easy your member bacause no all your member is clever",
            "Rating": 3,
            "Date": "January 3, 2023"
        },
        {
            "Title": "Absolutely Amazing, Works Perfectly. Makes dropshipping and fulfilling orders a million times easier.",
            "Rating": 3,
            "Date": "January 3, 2023"
        },
        {
            "Title": "Just started my Shopify store and it seems to be going well. It was simple to add products to my store and fulfill them.",
            "Rating": 3,
            "Date": "January 2, 2023"
        }
    ],
    [
        {
            "Title": "just trying zen drop seem to be okay .this is my first time trying this app i like it,it is very easy to use",
            "Rating": 3,
            "Date": "January 2, 2023"
        },
        {
            "Title": "I like Zen drop because its very cheap and gives you the opportunity to dropship on other websites...",
            "Rating": 3,
            "Date": "January 1, 2023"
        },
        {
            "Title": "قلة المنتجات والمتاجر ولا يتوفر تفصيل الشحن والقيم غير واضحةالفكرة جدا رائعة وسهل الاستخدام بشكل جدا ممتازاحببتة ولاكن لا تتوفر المنتجات",
            "Rating": 3,
            "Date": "December 28, 2022"
        },
        {
            "Title": "The app is great.Easy to add and edit products.My one big challenge is the shipping cost and duration to Kenya.This delivery period will not work for my customers at all.Can you assist on this?Can you connect me to your fulfilment centre nearer kenya t 3 to 5 days for products to get here?",
            "Rating": 3,
            "Date": "December 27, 2022"
        },
        {
            "Title": "scheint gut um anzufangen wie gut es genau jedoch ist werde ich noch herausfinden ich muss aber hundert wörter schreiben",
            "Rating": 3,
            "Date": "December 18, 2022"
        },
        {
            "Title": "First time ever hearing about this site so that's why i'm leaving 3 stars due to being new. I just started my online store and this site is helping a lot.",
            "Rating": 3,
            "Date": "December 17, 2022"
        },
        {
            "Title": "An excellent company to work with. Zendrop helped me get my first store off the ground, to selling products and making sales",
            "Rating": 3,
            "Date": "December 15, 2022"
        },
        {
            "Title": "Trying the app. Integration was good. Not too many products available on the free plan, but I found a product to try. Will update if/when I have additional feedback",
            "Rating": 3,
            "Date": "December 15, 2022"
        },
        {
            "Title": "Preety awesome app helped me a lot with my store. Adding products is so much easier now and i dont need to waste so much time on placing orders to my suppliers top product",
            "Rating": 3,
            "Date": "December 15, 2022"
        },
        {
            "Title": "žádné nemám, zatím to jen zkouším a učím se. Zatím objevují co vše lze pomoci Zendropu dělat a co zas ne.",
            "Rating": 3,
            "Date": "December 14, 2022"
        }
    ],
    [
        {
            "Title": "I was looking for a US based company and Zendrop popped up. I have not actually tried it yet but plan on adding a few items to see how it goes.",
            "Rating": 3,
            "Date": "December 14, 2022"
        },
        {
            "Title": "Aplicativo muito bom porem não usei todas as funcionalidades dele. mas por enquanto esta atendendo as minhas expectativas",
            "Rating": 3,
            "Date": "December 12, 2022"
        },
        {
            "Title": "The best Dropshipping serves. Products at a very affordable price, fast delivery and very easy to use platform",
            "Rating": 3,
            "Date": "December 12, 2022"
        },
        {
            "Title": "Aplicativo muito bom para usar, ainda tem que melhorar algumas funcionalidades. Na área tem que modificar algumas coisas quando exportar para a loja.",
            "Rating": 3,
            "Date": "Edited December 10, 2022"
        },
        {
            "Title": "Zendrop was created for Dropshippers, by Dropshippers. Zendrop is the solution to the ongoing problems you might find with other dropshipping suppliers! Our app makes the process easy and streamlined. They also allow you to earn credits for leaving a review.",
            "Rating": 3,
            "Date": "December 10, 2022"
        },
        {
            "Title": "Great app, great products but the worst downside is if you live in canada the shipping times arent great.",
            "Rating": 3,
            "Date": "December 9, 2022"
        },
        {
            "Title": "still learning but I love the process and hope many will experience this as well...........................",
            "Rating": 3,
            "Date": "December 6, 2022"
        },
        {
            "Title": "I really like it, but i wish we could import reviews. I was also thinking if we could have videos of the products.",
            "Rating": 3,
            "Date": "December 5, 2022"
        },
        {
            "Title": "vcvcvcvcvcc vcvc v c vc vc cv cvc vcv cv c cv cv c cv c vvcvc vc vcv vc vc vcv c v cv v voiuytfghjkmñn",
            "Rating": 3,
            "Date": "December 4, 2022"
        },
        {
            "Title": "So far it has been sufficient, but the fulfilment takes a bit long. Still waiting for an order to be fulfilled from Processing.",
            "Rating": 3,
            "Date": "December 2, 2022"
        }
    ],
    [
        {
            "Title": "i used this app to import and fullfill my order ,it was practial and easy to use they have excellent services ,",
            "Rating": 3,
            "Date": "December 2, 2022"
        },
        {
            "Title": "I wish there was an option to import product without adding it to your store so I can make it how I want it to look.",
            "Rating": 3,
            "Date": "November 30, 2022"
        },
        {
            "Title": "Ainda estou testando o app. Achei que falta algumas opções, commo por exemplo na hora de frete eu conseguir selecionar apenas o local que eu quero se eu estiver vendendo para um único país. Acho que seria melhor. E quanto a estimativa de lucro, também achei que deixa a desejar, se tivesse a opção que eu mencionei anteriorente, talvez fosse mais fácil calcular melhor, já com a estimativa de frete e quando for exportado para a shopfy já ir com todo o calculo feito, sem precisar fazer alterações.",
            "Rating": 3,
            "Date": "November 30, 2022"
        },
        {
            "Title": "must have platform for Dropshippers. Good supplier with interest products. I can recommend Zendrop.",
            "Rating": 3,
            "Date": "November 29, 2022"
        },
        {
            "Title": "Zendrop is really good for faster shipping, however, it is a little bit expensive and my products have been \"quoting\" for 5 days which makes me question the reliability.",
            "Rating": 3,
            "Date": "November 27, 2022"
        },
        {
            "Title": "Utilizzata per importare qualche prodotto.Ci sta, ma se non utilizzi il piano a pagamento può rivelarsi troppo lunga la spedizione.",
            "Rating": 3,
            "Date": "November 24, 2022"
        },
        {
            "Title": "Needs a wider selection of products. But I like how easy it is to import products to my store. 3 out of 5",
            "Rating": 3,
            "Date": "November 22, 2022"
        },
        {
            "Title": "Just trialing the Zendrop Dropshipping app because AliExpress was too expensive and CJ Dropshipping was an absolute debacle. The products available from within Zendrop Fulfillment channels are quite limited and I find I have to import the ones I need from AliExpress. I like the idea of the custom branding (on the higher paid brands) and the shipping channels look fast and reliable in comparison to the other Dropshipping apps. So far the set up is straight forward enough but I have yet to run any orders so will have to wait and see how that goes.",
            "Rating": 3,
            "Date": "November 21, 2022"
        },
        {
            "Title": "Good but need to add some extra things to the free plan so that it gets better and more people will then use it.",
            "Rating": 3,
            "Date": "November 21, 2022"
        },
        {
            "Title": "ho usato questo applicazione e va benissimo, non so perché fatico a capire come si collegano i prodotti dall'applicazione a shopify, devo dire un azione molto semplice e facile ma ora non si collega.",
            "Rating": 3,
            "Date": "November 21, 2022"
        }
    ],
    [
        {
            "Title": "i do enjoy how user friendly it is, and the help is patient. but i wish the shipping prices were better",
            "Rating": 3,
            "Date": "November 20, 2022"
        },
        {
            "Title": "This is a good app but processing time takes longer than what they say. A customer bought a product about a week ago and zendrop took way longer than 1-3 processing days",
            "Rating": 3,
            "Date": "November 19, 2022"
        },
        {
            "Title": "This app was a major help with supplying problems and in general made my drop shipping life a lot easier.",
            "Rating": 3,
            "Date": "November 19, 2022"
        },
        {
            "Title": "Cant remove your payment settings without adding a new one. Otherwise I don't have any other problems so i recommend that you don't add any payment methods because you CANT remove them.",
            "Rating": 3,
            "Date": "November 18, 2022"
        },
        {
            "Title": "easy to import products but sometimes just says importing... forever. other than that i would recommend",
            "Rating": 3,
            "Date": "November 16, 2022"
        },
        {
            "Title": "This app would help if you have money for a subscription but when you start from 0 it isn't really worth it",
            "Rating": 3,
            "Date": "November 11, 2022"
        },
        {
            "Title": "Seems good so far, but so far just starting so willl see in next coming days and months. Thanks a lot",
            "Rating": 3,
            "Date": "November 11, 2022"
        },
        {
            "Title": "Starting to use zendrop for my platform. So far so good we shall see how it continues to go. Easy setup",
            "Rating": 3,
            "Date": "November 9, 2022"
        },
        {
            "Title": "I was really excited about this app, I took the time to watch the meetings on YouTube to get ideas on how to better my experience. Some of the info was very helpful and I felt like I had a community. When it comes down to the actual process, I felt that it didn't live up to expectations. I ordered my first test product 4 days ago and I still cannot track the order. They give me a tracking number and it keeps saying unable to track. I am really glad I did this before anyone ordered from me because I would hate to come off looking like a fraud. I am a bit pissed because I spent all this time marketing the items and listing them in different places now I have to go back and remove them. Time wasted, but that's my fault because I should have ordered the test first. Also for the 1st tier-paid subscription, you really don't get a lot of benefits. I would think that they would offer really good benefits which would make people organically want to move to the next tier.",
            "Rating": 3,
            "Date": "November 6, 2022"
        },
        {
            "Title": "é um aplicativo bem, intuitivo e simples de usar. me ajudou a colocar meus produtos na loja de maneira simples",
            "Rating": 3,
            "Date": "November 4, 2022"
        }
    ],
    [
        {
            "Title": "Gives more information than DSERS, but costs alot for what it is. Also branding thats offered is only placing a thankyou card in the box its sending to customers. Would really benefit and be worth its price if branding could be placed on packaging or products.",
            "Rating": 3,
            "Date": "November 2, 2022"
        },
        {
            "Title": "In itself the app and website is pretty good. Well built and easy to import new products to your store. However, when signing up I was promised a \"30 day free trial\", but I only seem to be able to get a 7 day instead which is not a good way to welcome new people. For beginners this app has a expensive price for the paid plan which you will need to actually use it properly. Because of this I landed on a strong 3 stars since I can`t rate between 3 and 4 stars.",
            "Rating": 3,
            "Date": "November 2, 2022"
        },
        {
            "Title": "ainda nao tive muito tempo para a usar,de momento promete importação dos produtos para a loja demora muito",
            "Rating": 3,
            "Date": "November 1, 2022"
        },
        {
            "Title": "f f f gremkn kj bhiu hbhib uh vuh buh vuhb uh vu buh gbyu b8i gy8 buyh guy vbyuh v8oyu bhuo vbu bvhi bvih bhi biu biu biu biu gbiub iu b",
            "Rating": 3,
            "Date": "November 1, 2022"
        },
        {
            "Title": "Gostei me ajudou a achar prudutos e ter ideias de protudos pretendo usar mais para achar bons produtos para vender",
            "Rating": 3,
            "Date": "October 26, 2022"
        },
        {
            "Title": "The app has awesome supplies, I wanted some shoes on my website and I found some awesome deal on there. Only think I really don't like is for auto Fullment you have to pay.",
            "Rating": 3,
            "Date": "October 23, 2022"
        },
        {
            "Title": "Tem bons produtos mas é um fornecedor caro e o site extremamente lento. Sugiro melhorias nos preços e velocidade do site. É muito irritante essa lentidão!",
            "Rating": 3,
            "Date": "September 22, 2022"
        },
        {
            "Title": "While this app pricing is amazing leaving you with a high margin with fast shipping this app is limited in products when it comes to the coffee niche",
            "Rating": 3,
            "Date": "September 16, 2022"
        },
        {
            "Title": "very good product a nice prices , am happy work with this application. am satisfied with your product",
            "Rating": 3,
            "Date": "September 15, 2022"
        },
        {
            "Title": "all in all its great, but still needs improvement with zen drop support( never possible to get the bot to the concrete problem) and improve the thank you cart",
            "Rating": 3,
            "Date": "September 15, 2022"
        }
    ],
    [
        {
            "Title": "I found this app easy to navigate, and found a slim variety of the products im actually looking for, for my website.",
            "Rating": 3,
            "Date": "September 13, 2022"
        },
        {
            "Title": "I imported one thing, but intend to import more when I find some stuff. Not too sure on what else to write, but here it is.",
            "Rating": 3,
            "Date": "September 11, 2022"
        },
        {
            "Title": "sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa sympa",
            "Rating": 3,
            "Date": "September 10, 2022"
        },
        {
            "Title": "3 for now until I experience completing orders. UI is really easy to learn and runs pretty smooth so far.",
            "Rating": 3,
            "Date": "September 7, 2022"
        },
        {
            "Title": "i use that app to try drop shiping. realy good intarface i hope that will be okay i dont really know",
            "Rating": 3,
            "Date": "July 22, 2022"
        },
        {
            "Title": "I really liked the app, was just disappointed that there are not that many products that ship from the U.S.",
            "Rating": 3,
            "Date": "July 17, 2022"
        },
        {
            "Title": "Testando, até agora nada de mais espero que realmente tenha produtos com valor diferenciados! isso realmente vai fazer a diferença",
            "Rating": 3,
            "Date": "June 29, 2022"
        },
        {
            "Title": "The Zendrop App itself is very well made and user-friendly. But other than that delivery times have been pretty ok so far (mostly 15-16 days) with some delays here and there. Also Thank You cards haven't been working so far and order credits don't show up (maybe because I'm on the trial of the Plus Plan). Anyways supportwise though, it's perfect. Theresa, Molly and ESPECIALLY Michael have been a really big help overcoming those issues and are always here for me if there are any more. They really seem to care about my business and are understanding and (I think is also a really big point) fluent in English! Overall okay Dropshipping service with perfect support. Again, thank you Michael for everything!",
            "Rating": 3,
            "Date": "May 5, 2022"
        }
    ]
]